app/views/comments/_form.html.erb

    <%= f.label :user %><br />
    <%= f.collection_select :user_id, User.all, :id, :name %>
---
SELECT "users".* FROM "users"