app/controllers/comments_controller.rb

SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", "1"]]
INSERT INTO "comments" ("body", "created_at", "post_id", "updated_at", "user") VALUES (?, ?, ?, ?, ?)  [["body", "pepe comenta"], ["created_at", Sat, 21 Apr 2012 11:32:58 UTC +00:00], ["post_id", 1], ["updated_at", Sat, 21 Apr 2012 11:32:58 UTC +00:00], ["user", "pepe"]]
---
  def create
    @post = Post.find(params[:post_id])
    @comment = @post.comments.create(params[:comment])